# pandas_WarmUp_exercise
## h2
### h3

In [1]:
import pandas as pd

In [4]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# Display top 3 rows

In [5]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# Check last 3 rows of dataSet:

In [7]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# Find shape of our Data_Set (Number of rows and number of columns :)

In [8]:
df1.shape

(7, 3)

In [9]:
print("Number of rows :",df1.shape[0])
print("Number of columns :",df1.shape[1])

Number of rows : 7
Number of columns : 3

### Get Information about our Data Set like total number of Rows and Columns, datatype of each column and memory requirement:

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

### Check Null values in DataSet:

In [13]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

### Get overall Statistics of our DataFrame :

In [16]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

### Find unique values from Gender Column :

In [17]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [18]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

### Find the number of  unique values from Gender Column :

In [19]:
df1['Gender'].nunique()

2

### Display Count of Unique Values in Gender Column:

In [20]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

### Find total number of students having marks between 90 to 100 (inclusive) using between method

In [24]:
df1[df1['Marks'] >=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [26]:
df1[(df1['Marks'] >=90) & (df1['Marks'] <=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [27]:
len(df1[(df1['Marks'] >=90) & (df1['Marks'] <=100)])

4

In [29]:
sum(df1['Marks'].between(90,100))

4

### Find Average Marks :

In [30]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [31]:
df1['Marks'].mean()

92.14285714285714

### Minimum Marks:

In [32]:
df1['Marks'].min()

83

### Maximum Marks:

In [34]:
df1['Marks'].max()

99

### Apply Methods :

In [36]:
def marks(x):
    return x/2

In [41]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

### Adding new columns :

In [42]:
df1['Half_marks']=df1['Marks'].apply(marks) 
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5